controllers/SiteController.php

SELECT * FROM `user` WHERE (`email`='m_lenovo99@ukr.net') AND (`code`='rguRViQFUQ')
UPDATE `user` SET `code`='', `active`=1 WHERE `id`=15
---
    public function actionConfirmemail()
    {
        // Если пользователь авторизован, то возврощаем на домашнюю страницу
        if(!Yii::$app->user->isGuest)
        {
            return $this->goHome();
        }
        // разбираем ссылку
        $code = htmlspecialchars(Yii::$app->request->get('code'));
        $email = htmlspecialchars(Yii::$app->request->get('email'));

        // Ищим пользователя с таким E-mail и code
        $model = User::find()->where(['email' => $email, 'code' => $code])->one();
        // Если нашли
        if ($model->id)
        {
            $model->code = '';
            $model->active = Signup::ACTIVE_USER;
            $model->save();