models/Login.php

    public function getUser()
    {
        return User::findOne(['email'=>$this->email]); // а получаем мы его по введенному имейл
---
SELECT * FROM `user` WHERE `email`='cry.shop.acc@gmail.com'