models/Signup.php

    public function signup()
    {
        $user = new User();
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->firstname = $this->firstname;
        $user->surename = $this->surename;
        $user->city = $this->city;
        $user->date = $this->date;
        $user->code = $this->code;
        $user->active = 0;
        return $user->save(); //вернет true или false
---
INSERT INTO `user` (`email`, `password`, `firstname`, `surename`, `city`, `date`, `code`, `active`) VALUES ('m_lenovo99@ukr.net', '601f1889667efaebb33b8c12572835da3f027f78', 'Максим', 'Моргушко', 'Kyiv', '24-Лис-1999', 'rguRViQFUQ', 0)